openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Mcu.c
  return rv;
}

//-------------------------------------------------------------------

Mcu_ResetType Mcu_GetResetReason(void)
{
	Mcu_ResetType rv;

	VALIDATE_W_RV( ( 1 == Mcu_Global.initRun ), MCU_GETRESETREASON_SERVICE_ID, MCU_E_UNINIT, MCU_RESET_UNDEFINED );

#if defined(CFG_MPC560X)
	if( RGM.FES.B.F_SOFT ) {
		rv = MCU_SW_RESET;
	} else if( RGM.DES.B.F_SWT ) {
		rv = MCU_WATCHDOG_RESET;
	} else if( RGM.DES.B.F_POR ) {
		rv = MCU_POWER_ON_RESET;
	} else {
		rv = MCU_RESET_UNDEFINED;
	}
#else
	if( SIU.RSR.B.SSRS ) {
		rv = MCU_SW_RESET;
	} else if( SIU.RSR.B.WDRS ) {
		rv = MCU_WATCHDOG_RESET;
	} else if( SIU.RSR.B.PORS || SIU.RSR.B.ERS ) {
		rv = MCU_POWER_ON_RESET;
	} else {
		rv = MCU_RESET_UNDEFINED;
	}
#endif

	return rv;
}

//-------------------------------------------------------------------

Mcu_RawResetType Mcu_GetResetRawValue(void)
{
	VALIDATE_W_RV( ( 1 == Mcu_Global.initRun ), MCU_GETRESETREASON_SERVICE_ID, MCU_E_UNINIT, MCU_GETRESETRAWVALUE_UNINIT_RV );

	if( !Mcu_Global.initRun ) {
		return MCU_GETRESETRAWVALUE_UNINIT_RV;
	}

#if defined(CFG_MPC560X)
	if( RGM.DES.R )
		return RGM.DES.R;
	else
		return RGM.FES.R;
#else
	return SIU.RSR.R;
#endif

}

//-------------------------------------------------------------------

#if ( MCU_PERFORM_RESET_API == STD_ON )
void Mcu_PerformReset(void)
{
	VALIDATE( ( 1 == Mcu_Global.initRun ), MCU_PERFORMRESET_SERVICE_ID, MCU_E_UNINIT );

	// Reset
#if defined(CFG_MPC560X)
    ME.MCTL.R = 0x00005AF0;
    ME.MCTL.R = 0x0000A50F;

    while (ME.GS.B.S_MTRANS) {}
    while(ME.GS.B.S_CURRENTMODE != 0) {}
#else
	SIU.SRCR.B.SSR = 1;
#endif

}
#endif

//-------------------------------------------------------------------

#if defined(CFG_MPC5516) || defined(CFG_MPC5668)

/**
 *
 * Application Notes!
 * - AN3584, "MPC5510 Family Low Power Features"
 *   Since it's not complete also check MPC5668
 * - AN4150 , "Using Sleep Mode on the MPC5668x" and it's code
 *
 *
 * @param LPM
 */
static void enterLowPower (Mcu_ModeType mcuMode )
{


	uint32 timeout = 0;
	/* - Set the sleep bit; following a WAIT instruction, the device will go to sleep
	 * - enable the 1.2V internal regulator when in sleep mode only
	 * - MPC5516
	 *   - 0x1 8k, 0x2 16k, 0x3 32k, 0x6 64k -- RAMs maintain power
	 * - MPC5668
	 *   - 0x1 32k, 0x2 64k, 0x3 128k
	 */

	/* Set Recover Vector */
#if defined(CFG_MPC5516)
	WRITE32(CRP_PSCR, PSCR_SLEEP | PSCR_SLP12EN | PCSR_RAMSEL(RAMSEL_VAL));

	WRITE32(CRP_Z1VEC, ((uint32)&McuE_LowPowerRecoverFlash) | VLE_VAL );
	READWRITE32( CRP_RECPTR, RECPTR_FASTREC, 0 );

	Mcu_SavedHaltFlags = SIU.HLT.R;
	/* Halt everything */
	SIU.HLT.R = 0x3FFFFFFF;
	while((SIU.HLTACK.R != 0x3FFFFFFF) && (timeout++<3000)) {}

	/* put Z0 in reset if not used for wakeup */
	CRP.Z0VEC.B.Z0RST = 1;

#elif defined(CFG_MPC5668)
	READWRITE32(CRP_PSCR, (PSCR_SLEEP | PSCR_SLP12EN | PCSR_RAMSEL(0x7)), (PSCR_SLEEP | PSCR_SLP12EN | PCSR_RAMSEL(RAMSEL_VAL)));
	WRITE32(CRP_Z6VEC, ((uint32)&McuE_LowPowerRecoverFlash) | VLE_VAL );
	READWRITE32(CRP_RECPTR,RECPTR_FASTREC,0 );

	Mcu_SavedHaltFlags[0] = SIU.HLT0.R;
	Mcu_SavedHaltFlags[1] = SIU.HLT1.R;
	/* Halt everything */
    SIU.HLT0.R = 0x037FFF3D;
    SIU.HLT1.R = 0x18000F3C;
    while((SIU.HLTACK0.R != 0x037FFF3D) && (SIU.HLTACK1.R != 0x18000F3C) && (timeout<3000)){}
#else
#error CPU not defined
#endif

	/* put Z0 in reset if not used for wakeup */
	CRP.Z0VEC.B.Z0RST = 1;

    /* Save context and execute wait instruction.
	 *
	 * Things that matter here are
	 * - Z1VEC, determines where TLB0 will point. TLB0 is written with a
	 *   value at startup that 4K aligned to this address.
	 * - LowPower_Sleep() will save a interrupt context so we will return
	 *   intact.
	 * - For devices with little RAM we don't want to impose the alignment
	 *   requirements there. Almost as we have to occupy a 4K block for this..
	 *   although the code does not take that much space.
	 * */
	McuE_EnterLowPower(mcuMode);

    /* Clear sleep flags to allow pads to operate */
    CRP.PSCR.B.SLEEPF = 0x1;
}

#endif

void Mcu_SetMode( Mcu_ModeType mcuMode)
{
	VALIDATE( ( 1 == Mcu_Global.initRun ), MCU_SETMODE_SERVICE_ID, MCU_E_UNINIT );
	// VALIDATE( ( McuMode <= Mcu_Global.config->McuNumberOfMcuModes ), MCU_SETMODE_SERVICE_ID, MCU_E_PARAM_MODE );


#if defined(CFG_MPC5516) || defined(CFG_MPC5668)
	if( MCU_MODE_RUN == mcuMode ) {

		/* Get back to "normal" halt flags */
#if defined(CFG_MPC5516)
		SIU.HLT.R = Mcu_SavedHaltFlags;
#elif defined(CFG_MPC5668)
		SIU.HLT0.R = Mcu_SavedHaltFlags[0];
		SIU.HLT1.R = Mcu_SavedHaltFlags[1];
#endif

	} else if( MCU_MODE_SLEEP == mcuMode ) {
		/*
		 * Follows the AN3548 from Freescale
		 *
		 */
#if defined(USE_DMA)
		Dma_DeInit();
#endif


		/* Set system clock to 16Mhz IRC */
		SIU.SYSCLK.B.SYSCLKSEL = 0;

		/* Put flash in low-power mode */
		// TODO

		/* Put QQADC in low-power mode */
		// TODO

		/* Set us in SLEEP mode */
		CRP.PSCR.B.SLEEP = 1;


		enterLowPower(mcuMode);
	}
#else
	/* NOT SUPPORTED */
	(void) mcuMode;
#endif
}

//-------------------------------------------------------------------

/**
 * Get the system clock in Hz. It calculates the clock from the
 * different register settings in HW.
 */
uint32_t McuE_GetSystemClock(void)
{
	/*
	 * System clock calculation
	 *
	 * 5516 -  f_sys = extal * (emfd+16) / ( (eprediv+1) * ( erfd+1 ));
	 * 5567 -  f_sys = extal * (emfd+4) / ( (eprediv+1) * ( 2^erfd ));
	 * 563x -  We run in legacy mode = 5567
	 * 5606s - f_sys = extal * emfd / ((eprediv+1)*(2<<(erfd)));
	 */
#if defined(CFG_MPC5516) || defined(CFG_MPC5668)
	uint32_t eprediv = FMPLL.ESYNCR1.B.EPREDIV;
	uint32_t emfd = FMPLL.ESYNCR1.B.EMFD;
	uint32_t erfd = FMPLL.ESYNCR2.B.ERFD;
#elif defined(CFG_MPC5554) || defined(CFG_MPC5567) || defined(CFG_MPC5633)
	uint32_t eprediv = FMPLL.SYNCR.B.PREDIV;
	uint32_t emfd = FMPLL.SYNCR.B.MFD;
	uint32_t erfd = FMPLL.SYNCR.B.RFD;
#elif defined(CFG_MPC560XB)
    uint32_t eprediv = CGM.FMPLL_CR.B.IDF;
    uint32_t emfd = CGM.FMPLL_CR.B.NDIV;
    uint32_t erfd = CGM.FMPLL_CR.B.ODF;
#elif defined(CFG_MPC5606S) || defined(CFG_MPC5604P)
    uint32_t eprediv = CGM.FMPLL[0].CR.B.IDF;
    uint32_t emfd = CGM.FMPLL[0].CR.B.NDIV;
    uint32_t erfd = CGM.FMPLL[0].CR.B.ODF;
#endif

